var data = [];
var dataStr = '1、模仿游戏<br>\
<br>\
·医学专家说左耳是靠近心脏最近的地方，甜言蜜语要说给左耳听。<br>\
·喜欢的歌，静静地听，喜欢的人，远远地看！<br>\
·时光只会老去，但时光从不会欺骗我们。<br>\
<br>\
<br>\
2、爆裂鼓手<br>\
<br>\
·青春就是再近的距离，也要跑着去。<br>\
·青春是明知道错了，偏要任性到底！<br>\
·青春就是爱情友情梦想和热血。因为青春，所以来得及。<br>\
<br>\
<br>\
3、鸟人<br>\
<br>\
·时间一点一滴地过去，流逝告别。我们慢慢地走向一个被上帝作记号的地点。<br>\
·旋转着的，五彩缤纷的物质世界。等价交换的，最残酷的也最公平的寒冷人间。<br>\
·此刻的别离，我们沉默不语。不经世的我们，约好下一个路口等。<br>\
<br>\
<br>\
4、消失的爱人<br>\
<br>\
·不要跟丈母娘打麻将，不要跟想法比你多的女人上床，不要跟最好的朋友合伙开公司。<br>\
·你知道吗 听一个人说话，不要听他说了什么，而是要听他没说什么。<br>\
<br>\
<br>\
5、骄傲<br>\
<br>\
·独行太久心会变坚硬，只有爱会让它松动。<br>\
·痛苦的将就不如痛快的分手。<br>\
·在通往成功的道路上，坚持不等于缺心眼。<br>\
·人生的道路就如同内裤，每一条都是自己选的。<br>\
<br>\
<br>\
6、亲爱的<br>\
<br>\
·我们听过无数的道理，却仍旧过不好这一生。<br>\
·喜欢就会放肆，但爱就是克制。<br>\
·她们都是你漫漫长路上，只配错过的好姑娘。<br>\
<br>\
<br>\
7、布达佩斯大饭店<br>\
<br>\
·如果世界上曾经有那个人出现过，其他人都会变成将就。而我不愿意将就。<br>\
·你跑的那么慢，我当初是怎么让你追上的？<br>\
·世界上最痛苦的事，不是无能为力，而是当一切都触手可及，我却不愿伸出手去。<br>\
<br>\
<br>\
8、妈咪<br>\
<br>\
·那时候，我们以为喜欢就是永远。后来才发现，我们只有曾经，没有永远。<br>\
·我喜欢你 是我的 不是我的 我都喜欢<br>\
·我想从这里开始重新来过，和之前不一样的重新来过。<br>\
·既然已匆匆，不如早怀念。<br>\
<br>\
<br>\
9、普罗旺斯的夏天<br>\
<br>\
·时间太长 我怕等不到你，距离太远 我怕追不上你，爱情太沉 我怕放不下你。<br>\
·记忆总是喜欢添油加醋，它会朝着你期待的方向修改，当你欣喜若狂的时候，真相，会将你惊醒。<br>\
·总有一天，我会带你去只有我们两个人的地方。<br>\
<br>\
<br>\
10、平常的心<br>\
<br>\
·每个女孩，心中都有一只水晶鞋。<br>\
·Where there is kindness, there is goodness.And where there is goodness, there is magic. <br>\
·我也不知道那只美丽的玻璃鞋能否合我的脚。但是……如果合脚，你能接受这个真实的我吗？<br>\
<br>\
<br>\
11、爱很怪<br>\
<br>\
·人生就是一列开往坟墓的列车，路途上会有很多站，很难有人可以自始至终陪着走完。当陪你的人要下车时，即使不舍也该心存感激，然后挥手道别。<br>\
·我只能送你到这里了，剩下的路你要自己走，不要回头。<br>\
<br>\
<br>\
12、麦兜我和我妈咪<br>\
<br>\
·我一直在，守着你的天真和笑容。<br>\
·你总是这样轻言放弃的话，无论多久都只会原地踏步。<br>\
·大雄：“我不想长高” 多啦A梦：“为什么” 大雄：“因为我长高了哆啦A梦就不能牵到我的手了”<br>\
<br>\
<br>\
13、星际穿越<br>\
<br>\
·爱就是把某个人看得比你自己重要。<br>\
·做个好女孩，就像你从前一样。<br>\
<br>\
<br>\
14、哪啊哪啊哪啊神去村<br>\
<br>\
·我长成这样是为了让人看起来更想拥抱。<br>\
·如果你生气了，就欺负我好了，反正我那么喜欢你。<br>\
·我们有时并不想成为英雄，只是生活有时候超出我们的想象。<br>\
<br>\
<br>\
15、霍比特人3<br>\
<br>\
·她不只是宠物，她是我的家人。<br>\
·不要每次吵架都不说话， 不说话不能解决问题。<br>\
·没有天生就会照顾孩子的父母。<br>\
·人不是生来就懂得爱。<br>\
<br>\
<br>\
16、博物馆奇妙夜3<br>\
<br>\
·你装过头了 其实内在是一颗破碎的心。<br>\
·Are you reallyabcgonna save the world? 你真的要拯救世界吗? Yes. Yes, I am. 是的是的 没错<br>\
·You just officially hadabcthe worst date ever. 你圆满完成了史上最糟糕约会<br>\
<br>\
<br>\
17、外星醉汉PK地球神<br>\
<br>\
·我知道这希望渺茫，但是你不能总是保护他。<br>\
·哦，上帝不喜欢我。有些人会弄丢刀子，杯子。不，不应该是我啊！我弄丢了一条龙！<br>\
·不，你想错了，他在乎的不是你的外表，他看重的是你的灵魂。<br>\
<br>\
<br>\
18、变形金刚2<br>\
<br>\
·邓超：We are 伐木累<br>\
·王宝强：What are you弄啥哩？<br>\
·Angelababy：Boom ShakaLaka<br>\
·王宝强：郑恺你怎么又死在女人手里了？<br>\
<br>\
<br>\
19、2012<br>\
<br>\
·成长似乎就是不断发现，那些让自己魂牵梦绕的东西，原来都是一场场幻想，然后一次次从梦里醒过来，而现实从来连一点商量的余地都没有。<br>\
·如果你的梦想还没有实现,说明你的渴望还不够强烈!<br>\
·丢掉什么不重要，关键是找回来什么。<br>\
<br>\
<br>\
20、终结者3<br>\
<br>\
·当人们做不到一些事情的时候，他们就会对你说你也同样不能。<br>\
·如果你有梦想的话，就要去捍卫它。<br>\
·当你最认为困难的时候，其实就是你最接近成功的时候。<br>\
';
// 使用三个<br>将这个变量分开成数组形式
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
	// 对d数组中的每个元素再进行一次分解操作
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', ' ') + '.jpg',
        caption: c[0].split('、')[1],
		// 描述
        desc: c[1]
    });
    //console.log(c[0].replace('、', ' ') + '.jpg');
};